rottenpotatoes/app/controllers/movies_controller.rb

  def same_director #add same_director action
    @movie = Movie.find params[:id]
    if @movie.director && !@movie.director.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'AAA'

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "movies" SET "director" = 'James Cameron', "release_date" = '2015-03-14 00:00:00.000000', "updated_at" = '2015-03-14 12:10:09.125747' WHERE "movies"."id" = 7